[
    {
        "id": "ICAI25S01",
        "name": "Prof. Dr. A B M Shawkat Ali",
        "title": "Vice Chancellor, Bangladesh University of Business and Technology (BUBT)",
        "topic": "AI in Practice.",
        "email": "vc@bubt.edu.bd",
        "image": "https://i.postimg.cc/rskwnzwr/1727757968-Prof-Dr-ABM-Shawkat-Ali.jpg",
        "bio": "For over 28 years, Professor A B M Shawkat Ali has been working in universities across Asia, Australia and the South Pacific in the area of Computer Science. He is a Professor and Vice-Chancellor at the Bangladesh University of Business and Technology (BUBT) and a Data Scientist Consultant for the industry. He also worked as a Senate and Council member (elected) and has chaired the various programme evaluation and academic promotion committees. He obtained his PhD from Monash University, Australia, in Machine Learning. He has substantial experience as a lecturer, researcher, programme coordinator, research coordinator, Head of Department, Dean of School and Acting Vice-Chancellor. He has published over 160 Books, Book Chapters, Journals and Conference Papers. His research h-Index is 33. Under international collaboration, he established two international conferences in Fiji, the first of which was in the South Pacific in Computer Science and Engineering. He has received over 8 million research grants from industry, government, and international communities such as the EU, the USAID, the World Bank, the Canadian Grant Authority, and the Australian industry. He has been awarded several awards, including the Bangladesh Expatriates' Award 2023 (Research Category), Project of the Year from Thales Australia, the Vice-Chancellor Research Excellence Award from The University of Fiji, the Outstanding Leadership Award from IEEE, the Top 10 Course Designers CQUniversity, Excellence in Supervision Award CQUniversity, and the Post-Graduation Publication Award Monash University. He is a Senior Member of IEEE, the world's largest professional organisation."
    },
    {
        "id": "ICAI25S09",
        "name": "Dr. Mohammad Shamsul Arefin",
        "title": "President, Bangladesh Computer Society, Professor CSE and Dean, Faculty of ECE, CUET",
        "topic": "Ethical Use of AI in Academia: Challanges and Opportunities",
        "email": "sarefin@cuet.ac.bd",
        "image": "https://i.postimg.cc/cCkjnc0s/Whats-App-Image-2025-09-05-at-12-22-08-PM.jpg",
        "bio": "Dr. Mohammad Shamsul Arefin is the President of the Bangladesh Computer Society (BCS) and a Professor in the Department of Computer Science and Engineering at Chittagong University of Engineering & Technology (CUET), Bangladesh. He previously served as the Dean of the Faculty of Electrical and Computer Engineering at CUET. Dr. Arefin holds a Doctor of Engineering degree from Hiroshima University, Japan, which he earned under the MEXT scholarship program. He completed his M.Sc. in Computer Science and Engineering from the Bangladesh University of Engineering and Technology (BUET), and his B.Sc. in Computer Science from Khulna University.\n\nWith more than two decades of academic and research experience, Dr. Arefin has made significant contributions to the fields of data privacy, big data management, green computing, machine learning, image information processing, social network analysis, and recommender systems. He has also worked extensively on applying information and communication technologies (ICT) to agriculture, education, and environmental sustainability. He has authored over 200 refereed publications and delivered more than sixty invited talks and keynote speeches at national and international conferences. Dr. Arefin has supervised more than 150 undergraduate and postgraduate theses, and received research funding amounting to approximately USD one million from both domestic and international sources. His contributions to competitive academic events have been recognized with back-to-back Championship Awards in the International Conference Olympiad (ICO) in 2022 and 2023.\n\nDr. Arefin is widely recognized for his leadership in the computing community. He served as the Chair of the IEEE Computer Society Bangladesh Chapter (IEEE CS BDC), and as its Vice-Chair  in two consecutive years 2021 and 2022. He was the Conference Coordinator of the IEEE CS BDC in 2018 and 2019, and has played leading roles in numerous national and international conferences. He served as the General Chair of BIM 2023, BIM 2025, IDAA 2025, and COMPAS 2024, and as the Organizing Chair of ECCE 2025, BIM 2021, and BDML 2020. He was the Technical Program Committee Chair of ECCE 2017, Organizing Co-Chair of ECCE 2019, Technical Co-Chair of the IEEE CS BDC Winter Symposium 2020, and Technical Secretary of the 2021 edition of the same symposium.\n\nBeyond his academic and organizational achievements, Dr. Arefin is an active reviewer for many esteemed international journals, including IEEE Access, Computing and Informatics, ICT Express, and Cognitive Computation. He is a Fellow of both the Institution of Engineers, Bangladesh (IEB) and the Bangladesh Computer Society (BCS). Additionally, he is a member of the Institute of Electrical and Electronics Engineers (IEEE) and the Association for Computing Machinery (ACM). Through his visionary leadership, scholarly excellence, and dedicated service, Dr. Arefin continues to make transformative contributions to computing education, research, and professional development in Bangladesh and beyond."
    },
    {
        "id": "ICAI25S03",
        "name": "Dr. Shashikant Patil",
        "title": "Director and Professor, uGDX School of Technology, Atlas SkillTech University, Mumbai, India ",
        "topic": "Gen AI and Agentic AI",
        "email": "sspatil999@gmail.com",
        "image": "https://i.postimg.cc/C1vKJ4LD/IMG-2520-1-1.jpg",
        "bio": " Dr. Shashikant Patil is a distinguished Full Professor at ATLAS SkillTech University, Mumbai, and a prominent figure in engineering education and research. He is a Senior Member of IEEE and ACM, designated as a Fellow Member of IETE (FIETE) and Institution of Engineers India (FIE), and holds Chartered Engineer status. With over 28 years of teaching experience, Dr. Patil specializes in Signal & Image Processing, Automation and Robotics, Data Science, Analytics, and AI & Machine Learning. Previously associated with SVKM's NMIMS Mumbai, Dr. Patil has demonstrated exceptional commitment to scholarly excellence. He has reviewed over 5000 plus  research articles, serving as Associate Editor and Editorial Board Member for various international journals. His expertise extends to emerging technologies including quantum computing and big data analytics. Dr. Patil's dedication to professional service includes active participation in IEEE conferences and committees, earning recognition through multiple IEEE Access Journal reviewer certificates, and establishing him as a respected voice in the global engineering community."
    },
    {
        "id": "ICAI25S02",
        "name": "Prof. Ashad Kabir",
        "title": "Professor of Computer Science, Charles Sturt University, Australia",
        "topic": "Applications of Artificial Intelligence and Smartphone Apps in Health and Agriculture: Recent Advancements and Opportunities",
        "email": "akabir@csu.edu.au",
        "image": "https://i.postimg.cc/Y9y26Jc6/pic.jpg",
        "bio": "Professor Ashad Kabir is a distinguished scholar in applied artificial intelligence. He holds a PhD in Computer Science from Swinburne University of Technology, Australia, and currently serves as a Professor of Computer Science and the Leader of the Imaging and Sensing Research Group at Charles Sturt University (CSU). His academic career includes appointments at several esteemed institutions, including Rolls-Royce Corporate Lab at Nanyang Technological University (Singapore), Deakin University (Australia), Swinburne University of Technology (Australia), and INRIA at the University of Nantes (France). In Bangladesh, he worked at the University of Chittagong and CUET.\nProf Kabir’s research focuses on applying advanced technologies, including artificial intelligence and smartphone apps, to solve problems in the domains of health and agriculture. His research interests include applied machine/deep learning, smartphone apps, data analytics, digital health, and smart agriculture. He authored over 140 scholarly articles, secured over $7.1 million in external research grants, with five as lead investigator, and successfully supervised over 15 PhD and Honours theses to completion."
    },
    {
        "id": "ICAI25S04",
        "name": "Dr. Mohammad Firoz Mridha",
        "title": "Professor, Department of Computer Science, AIUB",
        "topic": "AI and Research Ethics: Opportunities and Responsibilities for Students",
        "email": "firoz.mridha@aiub.edu",
        "image": "https://i.postimg.cc/NFvcv9K0/dmfm-1.png",
        "bio": "M. F. Mridha (Senior Member IEEE, Professional Member ACM) is currently working as a Professor in the Department of Computer Science, American International University-Bangladesh (AIUB). He also worked as Associate Professor and Chairman in the Department of Computer Science and Engineering, Bangladesh University of Business and Technology (BUBT) from 2019 to 2022 as a CSE department faculty member at the University of Asia Pacific, and as a graduate head from 2012 to 2019. He is the founder and director of the Advanced Machine Intelligence Research Lab (AMIR Lab). He received his Ph.D. in the domain of AI from Jahangirnagar University in 2017. He has authored/edited several books with Springer and published more than 300 Journal (Including IEEE Transaction) and Conference (Including A* Conference) papers and cited more than 5200 times. His research interests include Artificial Intelligence (AI), Computer Vision (CV), Machine Learning (ML), Large Language Model (LLM), and Natural Language Processing (NLP) etc. He has served as a program committee member in several international conferences/workshops. He served as an Editorial Board Member of several journals including PLOS ONE Journal. He has been ranked among the top 0.5% of researchers worldwide by the ScholarGPS survey in 2024. He was also included among the top 2% of scientists worldwide in the 2024 edition of Stanford University/Elsevier. He achieved the top 5 most productive researchers in Bangladesh by (Scopus/ Elsevier) and secured the Top researcher in the field of Computer Science and Engineering in 2024."
    },
    {
        "id": "ICAI25S05",
        "name": "Dr. Md. Zulfiker Mahmud",
        "title": "Professor, Department of Computer Science & Engineering, Jagannath University",
        "topic": "Genesis System: A Dual-Model AI Framework for Reverse Engineering Microstrip Patch Antennas",
        "email": "zulfiker@cse.jnu.ac.bd",
        "image": "https://i.postimg.cc/KcVyckb7/photo-10532.jpg",
        "bio": "Dr. Md. Zulfiker Mahmud is an Professor of Computer Science and Engineering Department in Jagannath University, Bangladesh. He received the B.Sc (1st class 1st). and M.Sc. (1st class 1st) degree in Computer Science and Engineering from Islamic University Kushtia, Bangladesh. He has completed his Ph.D from Universiti Kebangsaan Malaysia (UKM), Malaysia. He obtained Excellent thesis award of FKAB UKM in 2018. He has authored or co-authored a number referred journals and conference papers. He has experience as Graduate Research Assistant at the Department of Electrical, Electronic and Systems Engineering, UKM, Malaysia. His research interests include the microwave imaging, antenna design, satellite antennas, satellite communication and wireless communication. He is also currently working on Machine Learning, IoT, Automated system and Embedded computing."
    },
    {
        "id": "ICAI25S10",
        "name": "Dr. Gaurav Kumar Bharti",
        "title": "Associate Professor, Department of Electrical, Electronics and Communication Engineering (DECE), Galgotias University\nExCom Member, IEEE Madhya Pradesh Section",
        "topic": "AI Assisted FBG Optical Sensors for Healthcare Applications",
        "email": "gauravkumarbharti7@ieee.org",
        "image": "https://i.postimg.cc/gj4DXcy8/Oo-ZYp-PNrl-HGb-Uf-Rt5l-FSw0n-CK0-Nca-Zb6-Zcg-Prh4o.jpg",
        "bio": "Dr. Gaurav Kumar Bharti has awarded PhD degree in the field of Photonics under the Electronics and Instrumentation Engineering Department of the National Institute of Technology, Agartala, Tripura, India (an institute of national importance in India) in 2020. He was an institute post-doctoral fellow at Indian Institute of Technology Guwahati, India (a premier institute of India) from Sep. 2020 to Dec. 2021. He is in the list of top 2% scientist for the year of 2023, as released by Stanford University (Based on the Scopus Data).\n\nHe is an active researcher in the field of photonics and more than fifty (50) of his research papers published/accepted in a reputed International Journals and Conferences with the citation of more than 500 and with the h-index of 15. He is the reviewer of the various peer-reviewed journals. His current research interests include Photonics, Optical Sensor, Quantum Computing, Cyber Physical Systems and Nonlinear Optics. He has guided two PhD as well as two M.E. scholars. He has authored two books and two chapters respectively. His two Indian Patent has been published. He has organized, delivered, and attended many Workshops, Seminars and National and International Conferences in India as well as in abroad. He has given the expert talk in the various reputed institutes of India and abroad, as well. He has both industrial and academic exposure. He has ongoing various sponsored research project and industrial consultancy of more than 50 lacs.\n\n He is the active member of IEEE, IEEE Photonics Society, IEEE Sensors Council, IEEE Nanotechnology Council, OPTICA (Formerly OSA), SPIE and other professional bodies. He is the founder and past Chairman of the IEEE NIT Agartala Student Branch (SB). He was also the Chapter Advisor of IEEE Photonics Society Chandigarh University Student Branch Chapter (SBC) from 2021-2023. He is also Founder and Past Branch Counselor of IEEE IIIT Bhopal Student Branch. As a IEEE member, he has performed various significant outreach duties/activities during his different IEEE positions which include Proctor, Mentor, Speaker at various platforms like IEEE, OPTICA, etc. Under his mentorship, the SBC and SB won several prestigious awards and grants from IEEE. He was Vice-Chair, Social Media IEEE Madhya Pradesh Section for the year 2024-25. Currently, he is an executive member in the IEEE Madhya Pradesh Committee 2025-26. \n\nDr. Bharti is an recipient of “Transformative Researcher of the Year Award-2022 for EE Department”, Best IEEE Chapter Advisor, which was awarded by Chandigarh University. He has received fellowship from different agencies/institutes which includes MoE, IITG, IFFP-CU as well as ITS Grant as an Young Scientist from ANRF (Formerly SERB, GoI). He was a Visiting Professor at İzmir Yüksek Teknoloji Enstitüsü, Turkey (A QS ranked University), during the Fall Semester 2022-23. From June 2023 to Feb 2025, he is with IIIT Bhopal as an Assistant Professor in Electronics and Communication Engineering Department. "
    },
    {
        "id": "ICAI25S06",
        "name": "Md Imdadul Islam",
        "title": "Sr. Business Development Manager, NetCom Learning",
        "topic": "Leveraging AI for Professional Growth",
        "email": "Imdadul@netcomlearning.com",
        "image": "https://i.postimg.cc/hv5DJgDQ/compressed-A7408746.png",
        "bio": "Imdad is a business strategist, speaker, and business collaborator with expertise in Modern Communication, Business Development, Leadership, Executive Coaching, Management Consulting, and Learning &amp; Development. As a sophomore, he co-founded Rich Insight Global (RIG), an accounting &amp; business advisory firm, alongside a professional accountant. His partnership with Xero, an Australian Stock Exchange-listed cloud accounting software company, enabled him to serve a diverse range of clients, including startups, SMEs, group companies, and MNCs. His passion for leveraging technology to drive business growth led him to NetCom Learning, a global leader in technology training, specializing in Artificial Intelligence (AI), Machine Learning (ML), Cloud Computing, Cybersecurity, and more. As a passionate speaker and consultant, he has conducted over 100 training and keynote sessions across various educational institutions and corporations including Beximco, Synovia, Nuvista, Incepta, Guardian Life Insurance, Akij, Abdul Monem, Urmi Group, Grameen Distribuiton etc. He is mostly spending his time in consulting companies to be an AI First Organization."
    },
    {
        "id": "ICAI25S08",
        "name": "Md Sohanur Rahman",
        "title": "Senior Data Analyst, V2 Technologies Ltd\nFormer Web Developer, Grameen Solutions Ltd.",
        "topic": "Innovating the Future with Big Data: Bridging Research and Industry",
        "email": "sohanur.math@gmail.com",
        "image": "https://i.postimg.cc/rmk35m4P/Whats-App-Image-2025-09-05-at-3-25-36-PM.jpg",
        "bio": "Sohanur Rahman is a Data Analyst at V2 Technology Ltd. and a Data Science Enthusiast based in Dhaka, Bangladesh. He is currently pursuing an Advanced Certificate for Management Professionals (ACMP) in Accounting and Business/Management with a specialization in Business Analytics from the Institute of Business Administration, University of Dhaka, expected in August 2025. He also holds an M.Sc. in Mathematics from National University, Bangladesh, and a B.Sc. in Mathematics from the same institution.\nWith over three years of experience, including nearly two years in data analysis and two years in web development, Mr. Rahman excels in data preprocessing, modeling, analytics, and visualization. He leverages predictive modeling and data mining to solve business challenges, actively contributing to the Python open-source community and enhancing his skills through a prestigious program co-designed by IBA, IIT Delhi, and IIM Ahmedabad, focusing on strategy, finance, project management, and data-driven decision-making.\nMr. Rahman has served as Data Analyst at V2 Technology Ltd. since October 2021, Web Developer at Grameen Solutions Ltd. from December 2019 to October 2021, and Junior Web Developer at Roopokar Creative Studio from September to November 2019. Currently, he leads Market Visit Analysis for Grameenphone, designing real-time performance tracking frameworks. His technical skills include Google Cloud, BigQuery, Looker, Power BI, Python, eCRM analytics, KPI management, ETL optimization, Microsoft Excel, Tableau, Google Data Studio, NumPy, Pandas, Matplotlib, Seaborn, Scikit-Learn, and core mathematics. He holds certifications in Big Data, Python, Google BigQuery, Applied Data Science, SQL, and Deep Learning.\nMr. Rahman has led projects such as sales consolidation for Bangladesh's largest tobacco company using AWS, BigQuery, and visualization tools; nationwide survey analysis for Project Cavalry with BigQuery and Google Data Studio; performance evaluation for Project Ls Reinforcement with Power BI; and ongoing Project Alchemy for consumer data analysis. His demo projects include reports on COVID data, e-commerce, finance, fuel economy, and sales, available on GitHub.\nDedicated to transforming data into actionable insights, Mr. Rahman continues to drive innovation in analytics and business growth in Bangladesh and beyond."
    },
    {
        "id": "ICAI25S07",
        "name": "Md. Fahim Hossain",
        "title": " Founder & Chairperson, Green Lead | Founder, Climate Intelligent Technologies (CIT)",
        "topic": "AI and Emerging Tech for Climate Action.",
        "email": "fahim@greenleadglobal.org",
        "image": "https://i.postimg.cc/ZnLGbxNb/Whats-App-Image-2025-09-03-at-11-07-26-PM.jpg",
        "bio": "Md. Fahim Hossain is the Founder and Chairperson of Green Lead, a social organization on a mission to mobilize a generation of leaders for a green world. With a background in Mechanical Engineering, Fahim is currently pursuing an MSc in Climate Change and Development, focusing on technology interventions for climate-induced challenges. \nHe also leads Climate Intelligent Technologies (CIT), developing climate-tech solutions to accelerate environmental action in the Global South. Fahim has represented Bangladesh at COP 29 in Azerbaijan, the Youth Assembly in the Philippines, the UN ESCAP Energy Forum in Thailand, and the Innovative Facilitation Fellowship in Sri Lanka. He is passionate about creating systems that equip youth with the skills and mindset to tackle planetary crises and build a just and sustainable future for all."
    }
]